Revit 2027 API
MaterialAspect Enumeration
 A list of all material aspects that a material can store PropertySetElements for.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum MaterialAspect
Public Enumeration MaterialAspect
public enum class MaterialAspect
type MaterialAspect
Members
Member name | Value | Description
EmbodiedCarbon | 2 |  EmbodiedCarbon
Structural | 0 |  Structural
Thermal | 1 |  Thermal
See Also
Reference
Autodesk.Revit.DB Namespace